Revit 2027 API
Reference.EqualTo Method
Checks if given reference is equal to this reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool EqualTo(
	Reference reference
)
Public Function EqualTo (
	reference As Reference
) As Boolean
public:
bool EqualTo(
	Reference^ reference
)
member EqualTo :
        reference : Reference -> bool
Parameters
reference Reference
Another reference.
Return Value
Boolean
Returns true if given reference is equal to this reference, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when argument is null.
See Also
Reference
Reference Class
Autodesk.Revit.DB Namespace